// database.js
// 专门存放历史数据的配置对象

const calDatabase = {
    "1944-06-06": {
        dateTitle: "6 June 1944 (D-Day)",
        frontline:,
        media:,
        microHistory: "<strong>微观生存志：最漫长的一天</strong><br>这一天之所以漫长，是因为在那24小时里，无数个不确定性被强行压缩。在奥马哈海滩，时间仿佛冻结；而在大洋彼岸的布鲁克林，像乔伊母亲海伦这样的普通人，守在收音机旁，祈祷着杠杆的另一端能撬起胜利。这绝不是轻松的'摘桃子'，而是一场不留退路的豪赌。"
    },
    "1944-08-25": {
        dateTitle: "25 August 1944 (Liberation of Paris)",
        frontline:,
        media:,
        microHistory: "<strong>微观生存志：胜利与饥饿并存</strong><br>巴黎没有被烧毁，但平民的胃依然是空的。黑市上，虽然解放军带来了吉普车和巧克力，但生活必需品依然需要高昂的法郎或几根好彩香烟来交换。在狂欢的人群背后，那些走出藏匿阁楼的犹太幸存者发现，他们的家早已不属于自己。胜利终结了纳粹的统治，但尚未终结生活的裂痕。"
    }
};